---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.IsEmpty
source: html/a26d926c-cb2e-cff7-f1f0-12b534cf481d.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.